MassTransfer/Cases/He100/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    liquid
    {
        type            patch;
        nFaces          1;
        startFace       99;
    }
    gas
    {
        type            patch;
        nFaces          1;
        startFace       100;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          400;
        startFace       101;
    }
)

// ************************************************************************* //
